ReplaceStrings/InsertSensor-Tsuruoka-template-ws-0.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosInsertSensor.xsd        http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd">
  <env:Body>
    <swes:InsertSensor service="SOS" version="2.0.0"
        xmlns:swes="http://www.opengis.net/swes/2.0"
        xmlns:sos="http://www.opengis.net/sos/2.0"
        xmlns:swe="http://www.opengis.net/swe/2.0"
        xmlns:sml="http://www.opengis.net/sensorml/2.0"
        xmlns:gml="http://www.opengis.net/gml/3.2"
        xmlns:xlink="http://www.w3.org/1999/xlink"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:gco="http://www.isotc211.org/2005/gco"
        xmlns:gmd="http://www.isotc211.org/2005/gmd">
      <swes:procedureDescriptionFormat>http://www.opengis.net/sensorml/2.0</swes:procedureDescriptionFormat>
      <swes:procedureDescription>
        <sml:PhysicalSystem gml:id="%id%">
          <!--Unique identifier -->
          <gml:identifier codeSpace="uniqueID">%procedure%</gml:identifier>
          <sml:identification>
            <sml:IdentifierList>
              <sml:identifier>
                <sml:Term definition="urn:ogc:def:identifier:OGC:1.0:longName">
                  <sml:label>longName</sml:label>
                  <sml:value>Weather Staion belongs to  National Institute of Technology, Tsuruoka College</sml:value>
                </sml:Term>
              </sml:identifier>
              <sml:identifier>
                <sml:Term definition="urn:ogc:def:identifier:OGC:1.0:shortName">
                  <sml:label>shortName</sml:label>
                  <sml:value>WS-Tsuruoka KOSEN</sml:value>
                </sml:Term>
              </sml:identifier>
            </sml:IdentifierList>
          </sml:identification>
          <sml:capabilities name="offerings">
            <sml:CapabilityList>
              <!-- Special capabilities used to specify offerings. -->
              <!-- Parsed and removed during InsertSensor/UpdateSensorDescription, 
                   added during DescribeSensor. -->
              <!-- Offering is generated if not specified. -->
              <sml:capability name="offeringID">
                <swe:Text definition="urn:ogc:def:identifier:OGC:offeringID">
                  <swe:label>offeringID</swe:label>
                  <swe:value>%offering%</swe:value>
                </swe:Text>
              </sml:capability>
            </sml:CapabilityList>
          </sml:capabilities>
          <sml:featuresOfInterest>
            <sml:FeatureList definition="http://www.opengis.net/def/featureOfInterest/identifier">
              <swe:label>featuresOfInterest</swe:label>
              <sml:feature xlink:href="%feartureOfInterest%"/>
            </sml:FeatureList>
          </sml:featuresOfInterest>
          <sml:outputs>
            <sml:OutputList>
              <sml:output name="air_temperature">
                <swe:Quantity definition="https://www.kantei.go.jp/jp/singi/it2/senmon_bunka/shiryo/agro-env.html#air_temperature">
                  <swe:uom code="Cel"/>
                </swe:Quantity>
              </sml:output>
              <sml:output name="relative_humidity">
                <swe:Quantity definition="https://www.kantei.go.jp/jp/singi/it2/senmon_bunka/shiryo/agro-env.html#relative_humidity">
                  <swe:uom code="%RH"/>
                </swe:Quantity>
              </sml:output>
            </sml:OutputList>
          </sml:outputs>
          <sml:attachedTo xlink:href="%feartureOfInterest%" xlink:title="%feartureOfInterest%"/>
          <sml:position>
            <swe:Vector referenceFrame="urn:ogc:def:crs:EPSG::4326">
              <swe:coordinate name="easting">
                <swe:Quantity axisID="x">
                  <swe:uom code="degree"/>
                  <swe:value>%x%</swe:value>
                </swe:Quantity>
              </swe:coordinate>
              <swe:coordinate name="northing">
                <swe:Quantity axisID="y">
                  <swe:uom code="degree"/>
                  <swe:value>%y%</swe:value>
                </swe:Quantity>
              </swe:coordinate>
              <swe:coordinate name="altitude">
                <swe:Quantity axisID="z">
                  <swe:uom code="m"/>
                  <swe:value>%z%</swe:value>
                </swe:Quantity>
              </swe:coordinate>
            </swe:Vector>
          </sml:position>
        </sml:PhysicalSystem>
      </swes:procedureDescription>
      <!-- multiple values possible -->
      <swes:observableProperty>https://www.kantei.go.jp/jp/singi/it2/senmon_bunka/shiryo/agro-env.html#air_temperature</swes:observableProperty>
      <swes:observableProperty>https://www.kantei.go.jp/jp/singi/it2/senmon_bunka/shiryo/agro-env.html#relative_humidity</swes:observableProperty>
      <swes:metadata>
        <sos:SosInsertionMetadata>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CategoryObservation</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CountObservation</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TextObservation</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TruthObservation</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_GeometryObservation</sos:observationType>
          <sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_SWEArrayObservation</sos:observationType>
          <!-- multiple values possible -->
          <sos:featureOfInterestType>http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint</sos:featureOfInterestType>
        </sos:SosInsertionMetadata>
      </swes:metadata>
    </swes:InsertSensor>
  </env:Body>
</env:Envelope>